Avnzx/bldc-STM32f446/comm/commands.c
		send_buffer[ind++] = HW_TYPE_VESC;

		send_buffer[ind++] = conf_custom_cfg_num();

#ifdef HW_HAS_PHASE_FILTERS
		send_buffer[ind++] = 1;
#else
		send_buffer[ind++] = 0;
#endif

#ifdef QMLUI_SOURCE_HW
#ifdef QMLUI_HW_FULLSCREEN
		send_buffer[ind++] = 2;
#else
		send_buffer[ind++] = 1;
#endif
#else
		send_buffer[ind++] = 0;
#endif

#ifdef QMLUI_SOURCE_APP
#ifdef QMLUI_APP_FULLSCREEN
		send_buffer[ind++] = 2;
#else
		send_buffer[ind++] = 1;
#endif
#else
        send_buffer[ind++] = 0;
#endif
		send_buffer[ind++] = nrf_flags;

		strcpy((char*)(send_buffer + ind), FW_NAME);
		ind += strlen(FW_NAME) + 1;

		buffer_append_uint32(send_buffer, 0, &ind);

		fw_version_sent_cnt++;

		reply_func(send_buffer, ind);
	} break;


	case COMM_LISP_SET_RUNNING:
	case COMM_LISP_GET_STATS:
	case COMM_LISP_REPL_CMD:
	case COMM_LISP_STREAM_CODE:
	case COMM_LISP_RMSG:
	case COMM_JUMP_TO_BOOTLOADER_ALL_CAN:
	case COMM_JUMP_TO_BOOTLOADER:
		//flash_helper_jump_to_bootloader(); <--- What bootloader :skull:
		break;


	case COMM_GET_QML_UI_APP:
	case COMM_LISP_READ_CODE:
	case COMM_QMLUI_ERASE:
	case COMM_LISP_ERASE_CODE:
	case COMM_QMLUI_WRITE:
	case COMM_LISP_WRITE_CODE:
	case COMM_GET_DECODED_ADC:
	case COMM_GET_DECODED_CHUK:
    case COMM_ERASE_BOOTLOADER_ALL_CAN:
	case COMM_ERASE_BOOTLOADER:
	case COMM_ERASE_NEW_APP_ALL_CAN:
	case COMM_WRITE_NEW_APP_DATA_ALL_CAN_LZO:
	case COMM_WRITE_NEW_APP_DATA_ALL_CAN:
	case COMM_WRITE_NEW_APP_DATA_LZO:
	case COMM_WRITE_NEW_APP_DATA:
	case COMM_ERASE_NEW_APP: {
        // FIXME AAVIN: Should this return 1 (FLASH_COMPLETE) or 0 (incomplete??)
		int32_t ind = 0;
		uint8_t send_buffer[50];
		send_buffer[ind++] = packet_id;
		send_buffer[ind++] = 0;
		reply_func(send_buffer, ind);
    } break;

	case COMM_GET_VALUES:
	case COMM_GET_VALUES_SELECTIVE: {
		int32_t ind = 0;
		uint8_t *send_buffer = mempools_get_packet_buffer();
		send_buffer[ind++] = packet_id;

		uint32_t mask = 0xFFFFFFFF;
		if (packet_id == COMM_GET_VALUES_SELECTIVE) {
			int32_t ind2 = 0;
			mask = buffer_get_uint32(data, &ind2);
			buffer_append_uint32(send_buffer, mask, &ind);
		}

		if (mask & ((uint32_t)1 << 0)) {
			buffer_append_float16(send_buffer, mc_interface_temp_fet_filtered(), 1e1, &ind);
		}
		if (mask & ((uint32_t)1 << 1)) {
			buffer_append_float16(send_buffer, mc_interface_temp_motor_filtered(), 1e1, &ind);
		}
		if (mask & ((uint32_t)1 << 2)) {
			buffer_append_float32(send_buffer, mc_interface_read_reset_avg_motor_current(), 1e2, &ind);
		}
		if (mask & ((uint32_t)1 << 3)) {
			buffer_append_float32(send_buffer, mc_interface_read_reset_avg_input_current(), 1e2, &ind);
		}
		if (mask & ((uint32_t)1 << 4)) {
			buffer_append_float32(send_buffer, mc_interface_read_reset_avg_id(), 1e2, &ind);
		}
		if (mask & ((uint32_t)1 << 5)) {
			buffer_append_float32(send_buffer, mc_interface_read_reset_avg_iq(), 1e2, &ind);
		}
		if (mask & ((uint32_t)1 << 6)) {
			buffer_append_float16(send_buffer, mc_interface_get_duty_cycle_now(), 1e3, &ind);
		}
		if (mask & ((uint32_t)1 << 7)) {
			buffer_append_float32(send_buffer, mc_interface_get_rpm(), 1e0, &ind);
		}
		if (mask & ((uint32_t)1 << 8)) {
			buffer_append_float16(send_buffer, mc_interface_get_input_voltage_filtered(), 1e1, &ind);
		}
		if (mask & ((uint32_t)1 << 9)) {
			buffer_append_float32(send_buffer, mc_interface_get_amp_hours(false), 1e4, &ind);
		}
		if (mask & ((uint32_t)1 << 10)) {
			buffer_append_float32(send_buffer, mc_interface_get_amp_hours_charged(false), 1e4, &ind);
		}
		if (mask & ((uint32_t)1 << 11)) {
			buffer_append_float32(send_buffer, mc_interface_get_watt_hours(false), 1e4, &ind);
		}
		if (mask & ((uint32_t)1 << 12)) {
			buffer_append_float32(send_buffer, mc_interface_get_watt_hours_charged(false), 1e4, &ind);
		}
		if (mask & ((uint32_t)1 << 13)) {
			buffer_append_int32(send_buffer, mc_interface_get_tachometer_value(false), &ind);
		}
		if (mask & ((uint32_t)1 << 14)) {
			buffer_append_int32(send_buffer, mc_interface_get_tachometer_abs_value(false), &ind);
		}
		if (mask & ((uint32_t)1 << 15)) {
			send_buffer[ind++] = mc_interface_get_fault();
		}
		if (mask & ((uint32_t)1 << 16)) {
			buffer_append_float32(send_buffer, mc_interface_get_pid_pos_now(), 1e6, &ind);
		}
		if (mask & ((uint32_t)1 << 17)) {
			uint8_t current_controller_id = app_get_configuration()->controller_id;
#ifdef HW_HAS_DUAL_MOTORS
			if (mc_interface_get_motor_thread() == 2) {
				current_controller_id = utils_second_motor_id();
			}
#endif
			send_buffer[ind++] = current_controller_id;
		}
		if (mask & ((uint32_t)1 << 18)) {
			if (mc_interface_get_motor_thread() == 2) {
				buffer_append_float16(send_buffer, NTC_TEMP_MOS1_M2(), 1e1, &ind);
				buffer_append_float16(send_buffer, NTC_TEMP_MOS2_M2(), 1e1, &ind);
				buffer_append_float16(send_buffer, NTC_TEMP_MOS3_M2(), 1e1, &ind);
			} else {
				buffer_append_float16(send_buffer, NTC_TEMP_MOS1(), 1e1, &ind);
				buffer_append_float16(send_buffer, NTC_TEMP_MOS2(), 1e1, &ind);
				buffer_append_float16(send_buffer, NTC_TEMP_MOS3(), 1e1, &ind);
			}
		}
		if (mask & ((uint32_t)1 << 19)) {
			buffer_append_float32(send_buffer, mc_interface_read_reset_avg_vd(), 1e3, &ind);
		}
		if (mask & ((uint32_t)1 << 20)) {
			buffer_append_float32(send_buffer, mc_interface_read_reset_avg_vq(), 1e3, &ind);
		}
		if (mask & ((uint32_t)1 << 21)) {
			uint8_t status = 0;
			status |= timeout_has_timeout();
			status |= timeout_kill_sw_active() << 1;
			send_buffer[ind++] = status;
		}

		reply_func(send_buffer, ind);
		mempools_free_packet_buffer(send_buffer);
	} break;

	case COMM_SET_DUTY: {
		int32_t ind = 0;
		mc_interface_set_duty((float)buffer_get_int32(data, &ind) / 100000.0);
		timeout_reset();
	} break;

	case COMM_SET_CURRENT: {
		int32_t ind = 0;
		mc_interface_set_current((float)buffer_get_int32(data, &ind) / 1000.0);
		timeout_reset();
	} break;

	case COMM_SET_CURRENT_BRAKE: {
		int32_t ind = 0;
		mc_interface_set_brake_current((float)buffer_get_int32(data, &ind) / 1000.0);
		timeout_reset();
	} break;

	case COMM_SET_RPM: {
		int32_t ind = 0;
		mc_interface_set_pid_speed((float)buffer_get_int32(data, &ind));
		timeout_reset();
	} break;

	case COMM_SET_POS: {
		int32_t ind = 0;
		mc_interface_set_pid_pos((float)buffer_get_int32(data, &ind) / 1000000.0);
		timeout_reset();
	} break;

	case COMM_SET_HANDBRAKE: {
		int32_t ind = 0;
		mc_interface_set_handbrake(buffer_get_float32(data, 1e3, &ind));
		timeout_reset();
	} break;

	case COMM_SET_DETECT: {
		int32_t ind = 0;
		display_position_mode = data[ind++];

		if (mc_interface_get_configuration()->motor_type == MOTOR_TYPE_BLDC) {
			if (display_position_mode == DISP_POS_MODE_NONE) {
				mc_interface_release_motor();
			} else if (display_position_mode == DISP_POS_MODE_INDUCTANCE) {
				mcpwm_set_detect();
				timeout_reset();
			}
		}
	} break;

	case COMM_SET_SERVO_POS: {
		int32_t ind = 0;
		pwm_servo_set_servo_out(buffer_get_float16(data, 1000.0, &ind));
	} break;

	case COMM_SET_MCCONF: {
#ifndef	HW_MCCONF_READ_ONLY
		mc_configuration *mcconf = mempools_alloc_mcconf();
		volatile const mc_configuration *mcconf_old = mc_interface_get_configuration();
		*mcconf = *mcconf_old;

		if (confgenerator_deserialize_mcconf(data, mcconf)) {
			utils_truncate_number(&mcconf->l_current_max_scale , 0.0, 1.0);
			utils_truncate_number(&mcconf->l_current_min_scale , 0.0, 1.0);

#if defined(HW_HAS_DUAL_MOTORS) & !defined(HW_SET_SINGLE_MOTOR)
			mcconf->motor_type = MOTOR_TYPE_FOC;
#endif

