Avnzx/bldc-STM32f446/comm/commands.c
			mcconf->lo_current_max = mcconf->l_current_max * mcconf->l_current_max_scale;
			mcconf->lo_current_min = mcconf->l_current_min * mcconf->l_current_min_scale;
			mcconf->lo_in_current_max = mcconf->l_in_current_max;
			mcconf->lo_in_current_min = mcconf->l_in_current_min;

			// Keep old offsets if writing offsets is disabled
			if (!(mcconf->foc_offsets_cal_mode & (1 << 1))) {
				mcconf->foc_offsets_current[0] = mcconf_old->foc_offsets_current[0];
				mcconf->foc_offsets_current[1] = mcconf_old->foc_offsets_current[1];
				mcconf->foc_offsets_current[2] = mcconf_old->foc_offsets_current[2];

				mcconf->foc_offsets_voltage[0] = mcconf_old->foc_offsets_voltage[0];
				mcconf->foc_offsets_voltage[1] = mcconf_old->foc_offsets_voltage[1];
				mcconf->foc_offsets_voltage[2] = mcconf_old->foc_offsets_voltage[2];

				mcconf->foc_offsets_voltage_undriven[0] = mcconf_old->foc_offsets_voltage_undriven[0];
				mcconf->foc_offsets_voltage_undriven[1] = mcconf_old->foc_offsets_voltage_undriven[1];
				mcconf->foc_offsets_voltage_undriven[2] = mcconf_old->foc_offsets_voltage_undriven[2];
			}

			commands_apply_mcconf_hw_limits(mcconf);
			conf_general_store_mc_configuration(mcconf, mc_interface_get_motor_thread() == 2);
			mc_interface_set_configuration(mcconf);
			chThdSleepMilliseconds(200);

			int32_t ind = 0;
			uint8_t send_buffer[50];
			send_buffer[ind++] = packet_id;
			reply_func(send_buffer, ind);
		} else {
			commands_printf("Warning: Could not set mcconf due to wrong signature");
		}

		mempools_free_mcconf(mcconf);
#endif
	} break;

	case COMM_GET_MCCONF:
	case COMM_GET_MCCONF_DEFAULT: {
		mc_configuration *mcconf = mempools_alloc_mcconf();

		if (packet_id == COMM_GET_MCCONF) {
			*mcconf = *mc_interface_get_configuration();
		} else {
			confgenerator_set_defaults_mcconf(mcconf);
			volatile const mc_configuration *mcconf_now = mc_interface_get_configuration();

			// Keep the old offsets
			mcconf->foc_offsets_current[0] = mcconf_now->foc_offsets_current[0];
			mcconf->foc_offsets_current[1] = mcconf_now->foc_offsets_current[1];
			mcconf->foc_offsets_current[2] = mcconf_now->foc_offsets_current[2];
			mcconf->foc_offsets_voltage[0] = mcconf_now->foc_offsets_voltage[0];
			mcconf->foc_offsets_voltage[1] = mcconf_now->foc_offsets_voltage[1];
			mcconf->foc_offsets_voltage[2] = mcconf_now->foc_offsets_voltage[2];
			mcconf->foc_offsets_voltage_undriven[0] = mcconf_now->foc_offsets_voltage_undriven[0];
			mcconf->foc_offsets_voltage_undriven[1] = mcconf_now->foc_offsets_voltage_undriven[1];
			mcconf->foc_offsets_voltage_undriven[2] = mcconf_now->foc_offsets_voltage_undriven[2];
		}

		commands_send_mcconf(packet_id, mcconf, reply_func);
		mempools_free_mcconf(mcconf);
	} break;

	case COMM_SET_APPCONF:
	case COMM_SET_APPCONF_NO_STORE: {
#ifndef	HW_APPCONF_READ_ONLY
		app_configuration *appconf = mempools_alloc_appconf();
		*appconf = *app_get_configuration();

		if (confgenerator_deserialize_appconf(data, appconf)) {
			if (packet_id == COMM_SET_APPCONF) {
				conf_general_store_app_configuration(appconf);
			}

			app_set_configuration(appconf);
			timeout_configure(appconf->timeout_msec, appconf->timeout_brake_current, appconf->kill_sw_mode);

			if (packet_id == COMM_SET_APPCONF) {
				chThdSleepMilliseconds(200);
			}

			int32_t ind = 0;
			uint8_t send_buffer[50];
			send_buffer[ind++] = packet_id;
			reply_func(send_buffer, ind);
		} else {
			commands_printf("Warning: Could not set appconf due to wrong signature");
		}

		mempools_free_appconf(appconf);
#endif
	} break;

	case COMM_GET_APPCONF:
	case COMM_GET_APPCONF_DEFAULT: {
		app_configuration *appconf = mempools_alloc_appconf();

		if (packet_id == COMM_GET_APPCONF) {
			*appconf = *app_get_configuration();
		} else {
			confgenerator_set_defaults_appconf(appconf);
		}

		commands_send_appconf(packet_id, appconf, reply_func);

		mempools_free_appconf(appconf);
	} break;

	case COMM_SAMPLE_PRINT: {
		uint16_t sample_len;
		uint8_t decimation;
		debug_sampling_mode mode;

		int32_t ind = 0;
		mode = data[ind++];
		sample_len = buffer_get_uint16(data, &ind);
		decimation = data[ind++];

		bool raw = false;
		if (len > (uint32_t)ind) {
			raw = data[ind++];
		}

		mc_interface_sample_print_data(mode, sample_len, decimation, raw, send_func);
	} break;

	case COMM_REBOOT:
		conf_general_store_backup_data();
		NVIC_SystemReset();
		break;

	case COMM_ALIVE:
		SHUTDOWN_RESET();
		timeout_reset();
		break;

	case COMM_GET_DECODED_PPM: {
		int32_t ind = 0;
		uint8_t send_buffer[50];
		send_buffer[ind++] = COMM_GET_DECODED_PPM;
		buffer_append_int32(send_buffer, (int32_t)(servodec_get_last_pulse_len(0) * 1000000.0), &ind);
		reply_func(send_buffer, ind);
	} break;


	case COMM_FORWARD_CAN: {
		send_func_can_fwd = reply_func;
		comm_can_send_buffer(data[0], data + 1, len - 1, 0);
	} break;

	case COMM_SET_CHUCK_DATA:
	case COMM_CUSTOM_APP_DATA:
	case COMM_CUSTOM_HW_DATA:
		break;

	case COMM_GET_VALUES_SETUP:
	case COMM_GET_VALUES_SETUP_SELECTIVE: {
		setup_values val = mc_interface_get_setup_values();

		float wh_batt_left = 0.0;
		float battery_level = mc_interface_get_battery_level(&wh_batt_left);

		int32_t ind = 0;
		uint8_t *send_buffer = mempools_get_packet_buffer();
		send_buffer[ind++] = packet_id;

		uint32_t mask = 0xFFFFFFFF;
		if (packet_id == COMM_GET_VALUES_SETUP_SELECTIVE) {
			int32_t ind2 = 0;
			mask = buffer_get_uint32(data, &ind2);
			buffer_append_uint32(send_buffer, mask, &ind);
		}

		if (mask & ((uint32_t)1 << 0)) {
			buffer_append_float16(send_buffer, mc_interface_temp_fet_filtered(), 1e1, &ind);
		}
		if (mask & ((uint32_t)1 << 1)) {
			buffer_append_float16(send_buffer, mc_interface_temp_motor_filtered(), 1e1, &ind);
		}
		if (mask & ((uint32_t)1 << 2)) {
			buffer_append_float32(send_buffer, val.current_tot, 1e2, &ind);
		}
		if (mask & ((uint32_t)1 << 3)) {
			buffer_append_float32(send_buffer, val.current_in_tot, 1e2, &ind);
		}
		if (mask & ((uint32_t)1 << 4)) {
			buffer_append_float16(send_buffer, mc_interface_get_duty_cycle_now(), 1e3, &ind);
		}
		if (mask & ((uint32_t)1 << 5)) {
			buffer_append_float32(send_buffer, mc_interface_get_rpm(), 1e0, &ind);
		}
		if (mask & ((uint32_t)1 << 6)) {
			buffer_append_float32(send_buffer, mc_interface_get_speed(), 1e3, &ind);
		}
		if (mask & ((uint32_t)1 << 7)) {
			buffer_append_float16(send_buffer, mc_interface_get_input_voltage_filtered(), 1e1, &ind);
		}
		if (mask & ((uint32_t)1 << 8)) {
			buffer_append_float16(send_buffer, battery_level, 1e3, &ind);
		}
		if (mask & ((uint32_t)1 << 9)) {
			buffer_append_float32(send_buffer, val.ah_tot, 1e4, &ind);
		}
		if (mask & ((uint32_t)1 << 10)) {
			buffer_append_float32(send_buffer, val.ah_charge_tot, 1e4, &ind);
		}
		if (mask & ((uint32_t)1 << 11)) {
			buffer_append_float32(send_buffer, val.wh_tot, 1e4, &ind);
		}
		if (mask & ((uint32_t)1 << 12)) {
			buffer_append_float32(send_buffer, val.wh_charge_tot, 1e4, &ind);
		}
		if (mask & ((uint32_t)1 << 13)) {
			buffer_append_float32(send_buffer, mc_interface_get_distance(), 1e3, &ind);
		}
		if (mask & ((uint32_t)1 << 14)) {
			buffer_append_float32(send_buffer, mc_interface_get_distance_abs(), 1e3, &ind);
		}
		if (mask & ((uint32_t)1 << 15)) {
			buffer_append_float32(send_buffer, mc_interface_get_pid_pos_now(), 1e6, &ind);
		}
		if (mask & ((uint32_t)1 << 16)) {
			send_buffer[ind++] = mc_interface_get_fault();
		}
		if (mask & ((uint32_t)1 << 17)) {
			uint8_t current_controller_id = app_get_configuration()->controller_id;
#ifdef HW_HAS_DUAL_MOTORS
			if (mc_interface_get_motor_thread() == 2) {
				current_controller_id = utils_second_motor_id();
			}
#endif
			send_buffer[ind++] = current_controller_id;
		}
		if (mask & ((uint32_t)1 << 18)) {
			send_buffer[ind++] = val.num_vescs;
		}
		if (mask & ((uint32_t)1 << 19)) {
			buffer_append_float32(send_buffer, wh_batt_left, 1e3, &ind);
		}
		if (mask & ((uint32_t)1 << 20)) {
			buffer_append_uint32(send_buffer, mc_interface_get_odometer(), &ind);
		}
		if (mask & ((uint32_t)1 << 21)) {
			buffer_append_uint32(send_buffer, chVTGetSystemTimeX() / (CH_CFG_ST_FREQUENCY / 1000), &ind);
		}

		reply_func(send_buffer, ind);
		mempools_free_packet_buffer(send_buffer);
	    } break;

	case COMM_SET_ODOMETER: {
		int32_t ind = 0;
		mc_interface_set_odometer(buffer_get_uint32(data, &ind));
		timeout_reset();
	} break;

