Avnzx/bldc-STM32f446/comm/commands.c
	case COMM_SET_MCCONF_TEMP:
	case COMM_SET_MCCONF_TEMP_SETUP: {
		mc_configuration *mcconf = mempools_alloc_mcconf();
		*mcconf = *mc_interface_get_configuration();

		int32_t ind = 0;
		bool store = data[ind++];
		bool forward_can = data[ind++];
		bool ack = data[ind++];
		bool divide_by_controllers = data[ind++];

		float controller_num = 1.0;

		if (divide_by_controllers) {
			for (int i = 0;i < CAN_STATUS_MSGS_TO_STORE;i++) {
				can_status_msg *msg = comm_can_get_status_msg_index(i);
				if (msg->id >= 0 && UTILS_AGE_S(msg->rx_time) < 0.1) {
					controller_num += 1.0;
				}
			}
		}

		mcconf->l_current_min_scale = buffer_get_float32_auto(data, &ind);
		mcconf->l_current_max_scale = buffer_get_float32_auto(data, &ind);

		if (packet_id == COMM_SET_MCCONF_TEMP_SETUP) {
			const float fact = ((mcconf->si_motor_poles / 2.0) * 60.0 *
					mcconf->si_gear_ratio) / (mcconf->si_wheel_diameter * M_PI);

			mcconf->l_min_erpm = buffer_get_float32_auto(data, &ind) * fact;
			mcconf->l_max_erpm = buffer_get_float32_auto(data, &ind) * fact;

			// Write computed RPM back and change forwarded packet id to
			// COMM_SET_MCCONF_TEMP. This way only the master has to be
			// aware of the setup information.
			ind -= 8;
			buffer_append_float32_auto(data, mcconf->l_min_erpm, &ind);
			buffer_append_float32_auto(data, mcconf->l_max_erpm, &ind);
		} else {
			mcconf->l_min_erpm = buffer_get_float32_auto(data, &ind);
			mcconf->l_max_erpm = buffer_get_float32_auto(data, &ind);
		}

		mcconf->l_min_duty = buffer_get_float32_auto(data, &ind);
		mcconf->l_max_duty = buffer_get_float32_auto(data, &ind);
		mcconf->l_watt_min = buffer_get_float32_auto(data, &ind) / controller_num;
		mcconf->l_watt_max = buffer_get_float32_auto(data, &ind) / controller_num;

		// Write divided data back to the buffer, as the other controllers have no way to tell
		// how many controllers are on the bus and thus need pre-divided data.
		// We set divide by controllers to false before forwarding.
		ind -= 8;
		buffer_append_float32_auto(data, mcconf->l_watt_min, &ind);
		buffer_append_float32_auto(data, mcconf->l_watt_max, &ind);

		// Battery limits can be set optionally in a backwards-compatible way.
		if ((int32_t)len >= (ind + 8)) {
			mcconf->l_in_current_min = buffer_get_float32_auto(data, &ind);
			mcconf->l_in_current_max = buffer_get_float32_auto(data, &ind);
		}

		mcconf->lo_current_min = mcconf->l_current_min * mcconf->l_current_min_scale;
		mcconf->lo_current_max = mcconf->l_current_max * mcconf->l_current_max_scale;
		mcconf->lo_in_current_min = mcconf->l_in_current_min;
		mcconf->lo_in_current_max = mcconf->l_in_current_max;

		commands_apply_mcconf_hw_limits(mcconf);

		if (store) {
			conf_general_store_mc_configuration(mcconf, mc_interface_get_motor_thread() == 2);
		}

		mc_interface_set_configuration(mcconf);

		if (forward_can) {
			data[-1] = COMM_SET_MCCONF_TEMP;
			data[1] = 0; // No more forward
			data[2] = 0; // No ack
			data[3] = 0; // No dividing, see comment above

			// TODO: Maybe broadcast on CAN-bus?
			for (int i = 0;i < CAN_STATUS_MSGS_TO_STORE;i++) {
				can_status_msg *msg = comm_can_get_status_msg_index(i);
				if (msg->id >= 0 && UTILS_AGE_S(msg->rx_time) < 0.1) {
					comm_can_send_buffer(msg->id, data - 1, len + 1, 2);
				}
			}
		}

		if (ack) {
			ind = 0;
			uint8_t send_buffer[50];
			send_buffer[ind++] = packet_id;
			reply_func(send_buffer, ind);
		}

		mempools_free_mcconf(mcconf);
	} break;

	case COMM_GET_MCCONF_TEMP: {
		mc_configuration *mcconf = mempools_alloc_mcconf();
		*mcconf = *mc_interface_get_configuration();
		int32_t ind = 0;
		uint8_t send_buffer[60];

		send_buffer[ind++] = packet_id;
		buffer_append_float32_auto(send_buffer, mcconf->l_current_min_scale, &ind);
		buffer_append_float32_auto(send_buffer, mcconf->l_current_max_scale, &ind);
		buffer_append_float32_auto(send_buffer, mcconf->l_min_erpm, &ind);
		buffer_append_float32_auto(send_buffer, mcconf->l_max_erpm, &ind);
		buffer_append_float32_auto(send_buffer, mcconf->l_min_duty, &ind);
		buffer_append_float32_auto(send_buffer, mcconf->l_max_duty, &ind);
		buffer_append_float32_auto(send_buffer, mcconf->l_watt_min, &ind);
		buffer_append_float32_auto(send_buffer, mcconf->l_watt_max, &ind);
		buffer_append_float32_auto(send_buffer, mcconf->l_in_current_min, &ind);
		buffer_append_float32_auto(send_buffer, mcconf->l_in_current_max, &ind);
		// Setup config needed for speed calculation
		send_buffer[ind++] = (uint8_t)mcconf->si_motor_poles;
		buffer_append_float32_auto(send_buffer, mcconf->si_gear_ratio, &ind);
		buffer_append_float32_auto(send_buffer, mcconf->si_wheel_diameter, &ind);

		mempools_free_mcconf(mcconf);
		reply_func(send_buffer, ind);
	} break;

	case COMM_APP_DISABLE_OUTPUT: {
		int32_t ind = 0;
		bool fwd_can = data[ind++];
		int time = buffer_get_int32(data, &ind);
		app_disable_output(time);

		if (fwd_can) {
			data[0] = 0; // Don't continue forwarding
			comm_can_send_buffer(255, data - 1, len + 1, 2);
		}
	} break;

	case COMM_TERMINAL_CMD_SYNC:
		data[len] = '\0';
		chMtxLock(&terminal_mutex);
		terminal_process_string((char*)data);
		chMtxUnlock(&terminal_mutex);
		break;

	case COMM_GET_IMU_DATA: {
		int32_t ind = 0;
		uint8_t send_buffer[70];
		send_buffer[ind++] = packet_id;
		reply_func(send_buffer, ind);
	} break;

	case COMM_SET_CURRENT_REL: {
		int32_t ind = 0;
		mc_interface_set_current_rel(buffer_get_float32(data, 1e5, &ind));
		timeout_reset();
	} break;

	case COMM_CAN_FWD_FRAME: {
		int32_t ind = 0;
		uint32_t id = buffer_get_uint32(data, &ind);
		bool is_ext = data[ind++];

		if (is_ext) {
			comm_can_transmit_eid(id, data + ind, len - ind);
		} else {
			comm_can_transmit_sid(id, data + ind, len - ind);
		}
	} break;

	case COMM_SET_BATTERY_CUT: {
		int32_t ind = 0;
		float start = buffer_get_float32(data, 1e3, &ind);
		float end = buffer_get_float32(data, 1e3, &ind);
		bool store = data[ind++];
		bool fwd_can = data[ind++];

		if (fwd_can) {
			comm_can_conf_battery_cut(255, store, start, end);
		}

		mc_configuration *mcconf = mempools_alloc_mcconf();
		*mcconf = *mc_interface_get_configuration();

		if (mcconf->l_battery_cut_start != start || mcconf->l_battery_cut_end != end) {
			mcconf->l_battery_cut_start = start;
			mcconf->l_battery_cut_end = end;

			if (store) {
				conf_general_store_mc_configuration(mcconf,
						mc_interface_get_motor_thread() == 2);
			}

