Avnzx/bldc-STM32f446/comm/commands.c
			mc_interface_set_configuration(mcconf);
		}

		mempools_free_mcconf(mcconf);

		// Send ack
		ind = 0;
		uint8_t send_buffer[50];
		send_buffer[ind++] = packet_id;
		reply_func(send_buffer, ind);
	} break;

	case COMM_GET_BATTERY_CUT: {
		int32_t ind = 0;
		uint8_t send_buffer[60];
		volatile const mc_configuration *mcconf = mc_interface_get_configuration();

		send_buffer[ind++] = packet_id;
		buffer_append_float32(send_buffer, mcconf->l_battery_cut_start, 1e3, &ind);
		buffer_append_float32(send_buffer, mcconf->l_battery_cut_end, 1e3, &ind);

		reply_func(send_buffer, ind);
	} break;

	case COMM_SET_CAN_MODE: {
		int32_t ind = 0;
		bool store = data[ind++];
		bool ack = data[ind++];
		int mode = data[ind++];

		app_configuration *appconf = mempools_alloc_appconf();
		*appconf = *app_get_configuration();
		appconf->can_mode = mode;

		if (store) {
			conf_general_store_app_configuration(appconf);
		}

		app_set_configuration(appconf);

		mempools_free_appconf(appconf);

		if (ack) {
			ind = 0;
			uint8_t send_buffer[50];
			send_buffer[ind++] = packet_id;
			reply_func(send_buffer, ind);
		}
	} break;

	case COMM_BMS_GET_VALUES:
	case COMM_BMS_SET_CHARGE_ALLOWED:
	case COMM_BMS_SET_BALANCE_OVERRIDE:
	case COMM_BMS_RESET_COUNTERS:
	case COMM_BMS_FORCE_BALANCE:
	case COMM_BMS_ZERO_CURRENT_OFFSET: {
		bms_process_cmd(data - 1, len + 1, reply_func);
		break;
	}

	// Power switch
	case COMM_PSW_GET_STATUS: {
		int32_t ind = 0;
		bool by_id = data[ind++];
		int id_ind = buffer_get_int16(data, &ind);

		int psws_num = 0;
		for (int i = 0;i < CAN_STATUS_MSGS_TO_STORE;i++) {
			psw_status *stat = comm_can_get_psw_status_index(i);
			if (stat->id >= 0) {
				psws_num++;
			} else {
				break;
			}
		}

		psw_status *stat = 0;
		if (by_id) {
			stat = comm_can_get_psw_status_id(id_ind);
		} else if (id_ind < psws_num) {
			stat = comm_can_get_psw_status_index(id_ind);
		}

		if (stat) {
			ind = 0;
			uint8_t send_buffer[70];

			send_buffer[ind++] = packet_id;
			buffer_append_int16(send_buffer, stat->id, &ind);
			buffer_append_int16(send_buffer, psws_num, &ind);
			buffer_append_float32_auto(send_buffer, UTILS_AGE_S(stat->rx_time), &ind);
			buffer_append_float32_auto(send_buffer, stat->v_in, &ind);
			buffer_append_float32_auto(send_buffer, stat->v_out, &ind);
			buffer_append_float32_auto(send_buffer, stat->temp, &ind);
			send_buffer[ind++] = stat->is_out_on;
			send_buffer[ind++] = stat->is_pch_on;
			send_buffer[ind++] = stat->is_dsc_on;

			reply_func(send_buffer, ind);
		}
	} break;

	case COMM_PSW_SWITCH: {
		int32_t ind = 0;
		int id = buffer_get_int16(data, &ind);
		bool is_on = data[ind++];
		bool plot = data[ind++];
		comm_can_psw_switch(id, is_on, plot);
	} break;

	case COMM_GET_QML_UI_HW: {
#ifdef QMLUI_SOURCE_HW
		int32_t ind = 0;

		int32_t len_qml = buffer_get_int32(data, &ind);
		int32_t ofs_qml = buffer_get_int32(data, &ind);

		if ((len_qml + ofs_qml) > DATA_QML_HW_SIZE || len_qml > (PACKET_MAX_PL_LEN - 10)) {
			break;
		}

		uint8_t *send_buffer_global = mempools_get_packet_buffer();
		ind = 0;
		send_buffer_global[ind++] = packet_id;
		buffer_append_int32(send_buffer_global, DATA_QML_HW_SIZE, &ind);
		buffer_append_int32(send_buffer_global, ofs_qml, &ind);
		memcpy(send_buffer_global + ind, data_qml_hw + ofs_qml, len_qml);
		ind += len_qml;
		reply_func(send_buffer_global, ind);

		mempools_free_packet_buffer(send_buffer_global);
#endif
	} break;

	case COMM_IO_BOARD_GET_ALL: {
		int32_t ind = 0;
		int id = buffer_get_int16(data, &ind);

		io_board_adc_values *adc_1_4 = comm_can_get_io_board_adc_1_4_id(id);
		io_board_adc_values *adc_5_8 = comm_can_get_io_board_adc_5_8_id(id);
		io_board_digial_inputs *digital_in = comm_can_get_io_board_digital_in_id(id);

		if (!adc_1_4 && !adc_5_8 && !digital_in) {
			break;
		}

		uint8_t send_buffer[70];
		ind = 0;
		send_buffer[ind++] = packet_id;
		buffer_append_int16(send_buffer, id, &ind);

		if (adc_1_4) {
			send_buffer[ind++] = 1;
			buffer_append_float32_auto(send_buffer, UTILS_AGE_S(adc_1_4->rx_time), &ind);
			buffer_append_float16(send_buffer, adc_1_4->adc_voltages[0], 1e2, &ind);
			buffer_append_float16(send_buffer, adc_1_4->adc_voltages[1], 1e2, &ind);
			buffer_append_float16(send_buffer, adc_1_4->adc_voltages[2], 1e2, &ind);
			buffer_append_float16(send_buffer, adc_1_4->adc_voltages[3], 1e2, &ind);
		}

		if (adc_5_8) {
			send_buffer[ind++] = 2;
			buffer_append_float32_auto(send_buffer, UTILS_AGE_S(adc_1_4->rx_time), &ind);
			buffer_append_float16(send_buffer, adc_5_8->adc_voltages[0], 1e2, &ind);
			buffer_append_float16(send_buffer, adc_5_8->adc_voltages[1], 1e2, &ind);
			buffer_append_float16(send_buffer, adc_5_8->adc_voltages[2], 1e2, &ind);
			buffer_append_float16(send_buffer, adc_5_8->adc_voltages[3], 1e2, &ind);
		}

		if (digital_in) {
			send_buffer[ind++] = 3;
			buffer_append_float32_auto(send_buffer, UTILS_AGE_S(adc_1_4->rx_time), &ind);
			buffer_append_uint32(send_buffer, (digital_in->inputs >> 32) & 0xFFFFFFFF, &ind);
			buffer_append_uint32(send_buffer, (digital_in->inputs >> 0) & 0xFFFFFFFF, &ind);
		}

		reply_func(send_buffer, ind);
	} break;

	case COMM_IO_BOARD_SET_PWM: {
		int32_t ind = 0;
		int id = buffer_get_int16(data, &ind);
		int channel = buffer_get_int16(data, &ind);
		float duty = buffer_get_float32_auto(data, &ind);
		comm_can_io_board_set_output_pwm(id, channel, duty);
	} break;

	case COMM_IO_BOARD_SET_DIGITAL: {
		int32_t ind = 0;
		int id = buffer_get_int16(data, &ind);
		int channel = buffer_get_int16(data, &ind);
		bool on = data[ind++];
		comm_can_io_board_set_output_digital(id, channel, on);
	} break;

	case COMM_GET_STATS: {
		int32_t ind = 0;
		uint32_t mask = buffer_get_uint16(data, &ind);

		ind = 0;
		uint8_t send_buffer[60];
		send_buffer[ind++] = packet_id;
		buffer_append_uint32(send_buffer, mask, &ind);

		if (mask & ((uint32_t)1 << 0)) { buffer_append_float32_auto(send_buffer, mc_interface_stat_speed_avg(), &ind); }
		if (mask & ((uint32_t)1 << 1)) { buffer_append_float32_auto(send_buffer, mc_interface_stat_speed_max(), &ind); }
		if (mask & ((uint32_t)1 << 2)) { buffer_append_float32_auto(send_buffer, mc_interface_stat_power_avg(), &ind); }
		if (mask & ((uint32_t)1 << 3)) { buffer_append_float32_auto(send_buffer, mc_interface_stat_power_max(), &ind); }
		if (mask & ((uint32_t)1 << 4)) { buffer_append_float32_auto(send_buffer, mc_interface_stat_current_avg(), &ind); }
		if (mask & ((uint32_t)1 << 5)) { buffer_append_float32_auto(send_buffer, mc_interface_stat_current_max(), &ind); }
		if (mask & ((uint32_t)1 << 6)) { buffer_append_float32_auto(send_buffer, mc_interface_stat_temp_mosfet_avg(), &ind); }
		if (mask & ((uint32_t)1 << 7)) { buffer_append_float32_auto(send_buffer, mc_interface_stat_temp_mosfet_max(), &ind); }
		if (mask & ((uint32_t)1 << 8)) { buffer_append_float32_auto(send_buffer, mc_interface_stat_temp_motor_avg(), &ind); }
		if (mask & ((uint32_t)1 << 9)) { buffer_append_float32_auto(send_buffer, mc_interface_stat_temp_motor_max(), &ind); }
		if (mask & ((uint32_t)1 << 10)) { buffer_append_float32_auto(send_buffer, mc_interface_stat_count_time(), &ind); }

		reply_func(send_buffer, ind);
	} break;

	case COMM_RESET_STATS: {
		bool ack = false;

		if (len > 0) {
			ack = data[0];
		}

