Avnzx/bldc-STM32f446/comm/commands.c
		mc_interface_stat_reset();

		if (ack) {
			int32_t ind = 0;
			uint8_t send_buffer[50];
			send_buffer[ind++] = packet_id;
			reply_func(send_buffer, ind);
		}
	} break;

	case COMM_GET_GNSS: {
		int32_t ind = 0;
		uint32_t mask = buffer_get_uint16(data, &ind);

		volatile gnss_data *g = mc_interface_gnss();

		ind = 0;
		uint8_t send_buffer[80];
		send_buffer[ind++] = packet_id;
		buffer_append_uint32(send_buffer, mask, &ind);

		if (mask & ((uint32_t)1 << 0)) { buffer_append_double64(send_buffer, g->lat, D(1e16), &ind); }
		if (mask & ((uint32_t)1 << 1)) { buffer_append_double64(send_buffer, g->lon, D(1e16), &ind); }
		if (mask & ((uint32_t)1 << 2)) { buffer_append_float32_auto(send_buffer, g->height, &ind); }
		if (mask & ((uint32_t)1 << 3)) { buffer_append_float32_auto(send_buffer, g->speed, &ind); }
		if (mask & ((uint32_t)1 << 4)) { buffer_append_float32_auto(send_buffer, g->hdop, &ind); }
		if (mask & ((uint32_t)1 << 5)) { buffer_append_int32(send_buffer, g->ms_today, &ind); }
		if (mask & ((uint32_t)1 << 6)) { buffer_append_int16(send_buffer, g->yy, &ind); }
		if (mask & ((uint32_t)1 << 7)) { send_buffer[ind++] = g->mo; }
		if (mask & ((uint32_t)1 << 8)) { send_buffer[ind++] = g->dd; }
		if (mask & ((uint32_t)1 << 9)) { buffer_append_float32_auto(send_buffer, UTILS_AGE_S(g->last_update), &ind); }

		reply_func(send_buffer, ind);
	} break;

	case COMM_GET_CUSTOM_CONFIG:
	case COMM_GET_CUSTOM_CONFIG_DEFAULT:
	case COMM_SET_CUSTOM_CONFIG:
	case COMM_GET_CUSTOM_CONFIG_XML: {
		conf_custom_process_cmd(data - 1, len + 1, reply_func);
	} break;


	case COMM_SHUTDOWN: {
		int ind = 0;
		int force = data[ind++];
		if ((fabsf(mc_interface_get_rpm()) > 100) && (force != 1)) {
			// Don't allow shutdown/restart while riding, unless force == 1
			break;
		}

		int is_restart = data[ind++];
		if (is_restart == 1) {
			// same as terminal rebootwdt command
			chSysLock();
			for (;;) {__NOP();}
		}
		else {
			do_shutdown(false);
		}
	} break;

	case COMM_FW_INFO: {
		// Write at most the first max_len characters of str into buffer,
		// followed by a null byte.
		void buffer_append_str_max_len(uint8_t *buffer, char *str, size_t max_len, int32_t *index) {
			size_t str_len = strlen(str);
			if (str_len > max_len) {
				str_len = max_len;
				return;
			}
			
			memcpy(&buffer[*index], str, str_len);
			*index += str_len;
			buffer[(*index)++] = '\0';
		}
		
		int32_t ind = 0;
		uint8_t send_buffer[98];
		
		send_buffer[ind++] = COMM_FW_INFO;
		
		// This information is technically duplicated with COMM_FW_VERSION, but
		// I don't care.
		send_buffer[ind++] = FW_VERSION_MAJOR;
		send_buffer[ind++] = FW_VERSION_MINOR;
		send_buffer[ind++] = FW_TEST_VERSION_NUMBER;
		
		// We don't include the branch name unfortunately
		buffer_append_str_max_len(send_buffer, GIT_COMMIT_HASH, 46, &ind);
#ifdef USER_GIT_COMMIT_HASH
		char *user_commit_hash = USER_GIT_COMMIT_HASH;
#else
		char *user_commit_hash = "";
#endif
		buffer_append_str_max_len(send_buffer, user_commit_hash, 46, &ind);

		reply_func(send_buffer, ind);
	} break;

	case COMM_MOTOR_ESTOP: {
		int32_t ind = 0;
		mc_interface_ignore_input_both(buffer_get_uint16(data, &ind));
		mc_interface_release_motor_override_both();
	} break;

	// Blocking commands. Only one of them runs at any given time, in their
	// own thread. If other blocking commands come before the previous one has
	// finished, they are discarded.
	case COMM_TERMINAL_CMD:
	case COMM_DETECT_MOTOR_PARAM:
	case COMM_DETECT_MOTOR_R_L:
	case COMM_DETECT_MOTOR_FLUX_LINKAGE:
	case COMM_DETECT_ENCODER:
	case COMM_DETECT_HALL_FOC:
	case COMM_DETECT_MOTOR_FLUX_LINKAGE_OPENLOOP:
	case COMM_DETECT_APPLY_ALL_FOC:
	case COMM_PING_CAN:
	case COMM_BM_CONNECT:
	case COMM_BM_ERASE_FLASH_ALL:
	case COMM_BM_WRITE_FLASH_LZO:
	case COMM_BM_WRITE_FLASH:
	case COMM_BM_REBOOT:
	case COMM_BM_DISCONNECT:
	case COMM_BM_MAP_PINS_DEFAULT:
	case COMM_BM_MAP_PINS_NRF5X:
	case COMM_BM_MEM_READ:
	case COMM_GET_IMU_CALIBRATION:
	case COMM_BM_MEM_WRITE:
	case COMM_CAN_UPDATE_BAUD_ALL:
		if (!is_blocking) {
			memcpy(blocking_thread_cmd_buffer, data - 1, len + 1);
			blocking_thread_cmd_len = len + 1;
			is_blocking = true;
			blocking_thread_motor = mc_interface_get_motor_thread();
			send_func_blocking = reply_func;
			chEvtSignal(blocking_tp, (eventmask_t)1);
		}
		break;

	default:
		break;
	}
}

int commands_printf(const char* format, ...) {
	chMtxLock(&print_mutex);

	va_list arg;
	va_start (arg, format);
	int len;

	print_buffer[0] = COMM_PRINT;
	len = vsnprintf(print_buffer + 1, (PRINT_BUFFER_SIZE - 1), format, arg);
	va_end (arg);

	int len_to_print = (len < (PRINT_BUFFER_SIZE - 1)) ? len + 1 : PRINT_BUFFER_SIZE;

	if (len > 0) {
		commands_send_packet_last_blocking((unsigned char*)print_buffer, len_to_print);
	}

	chMtxUnlock(&print_mutex);

	return len_to_print - 1;
}

int commands_printf_lisp(const char* format, ...) {
	chMtxLock(&print_mutex);

	va_list arg;
	va_start (arg, format);
	int len;

	print_buffer[0] = COMM_LISP_PRINT;
	int offset = 1;
	size_t prefix_len = sprintf(print_buffer + offset, lispif_print_prefix(), "%s");
	offset += prefix_len;

	len = vsnprintf(
		print_buffer + offset, (PRINT_BUFFER_SIZE - offset), format, arg
	);
	va_end(arg);

	int len_to_print = (len < (PRINT_BUFFER_SIZE - offset)) ? len + offset : PRINT_BUFFER_SIZE;
	
	for (size_t i = 2; i < (size_t)len_to_print; i++) {
		// TODO: Handle newline character in prefix?
		char chr = print_buffer[i - 1];
		if (chr == '\0') {
			break;
		}
		if (chr == '\n') {
			int remaining_len = len_to_print - i;
			if (remaining_len > (int)(PRINT_BUFFER_SIZE - i - prefix_len)) {
				remaining_len = PRINT_BUFFER_SIZE - i - prefix_len;
			}
			if (remaining_len <= 0) {
				break;
			}
			memmove(print_buffer + i + prefix_len, print_buffer + i, remaining_len);
			memmove(print_buffer + i, lispif_print_prefix(), prefix_len);
			i += prefix_len;
			len_to_print += prefix_len;
		}
		
		if (len_to_print > PRINT_BUFFER_SIZE) {
			len_to_print = PRINT_BUFFER_SIZE;
		}
	}

	if (len > 0) {
		if (print_buffer[len_to_print - 1] == '\n') {
			len_to_print--;
		}

		commands_send_packet((unsigned char*)print_buffer, len_to_print);

		// Uncomment to always print to USB. Useful when debugging code that redirects prints
//		comm_usb_send_packet((unsigned char*)print_buffer, len_to_print);
	}

	chMtxUnlock(&print_mutex);

	return len_to_print - 1;
}

void commands_send_rotor_pos(float rotor_pos) {
	uint8_t buffer[5];
	int32_t index = 0;
	buffer[index++] = COMM_ROTOR_POSITION;
	buffer_append_int32(buffer, (int32_t)(rotor_pos * 100000.0), &index);
	commands_send_packet(buffer, index);
}

void commands_send_experiment_samples(float *samples, int len) {
	if ((len * 4 + 1) > 256) {
		return;
	}

	uint8_t buffer[len * 4 + 1];
	int32_t index = 0;

