Avnzx/bldc-STM32f446/comm/commands.c
	buffer[index++] = COMM_EXPERIMENT_SAMPLE;

	for (int i = 0;i < len;i++) {
		buffer_append_int32(buffer, (int32_t)(samples[i] * 10000.0), &index);
	}

	commands_send_packet(buffer, index);
}

void commands_fwd_can_frame(int len, unsigned char *data, uint32_t id, bool is_extended) {
	if (len > 8) {
		len = 8;
	}

	uint8_t buffer[len + 6];
	int32_t index = 0;
	buffer[index++] = COMM_CAN_FWD_FRAME;
	buffer_append_uint32(buffer, id, &index);
	buffer[index++] = is_extended;
	memcpy(buffer + index, data, len);
	index += len;
	commands_send_packet(buffer, index);
}

disp_pos_mode commands_get_disp_pos_mode(void) {
	return display_position_mode;
}

bool commands_set_app_data_handler(void(*func)(unsigned char *data, unsigned int len)) {
	if (utils_is_func_valid(func)) {
		appdata_func = func;
		return true;
	} else {
		appdata_func = 0;
	}

	return false;
}

void commands_set_hw_data_handler(void(*func)(unsigned char *data, unsigned int len)) {
	hwdata_func = func;
}

void commands_send_app_data(unsigned char *data, unsigned int len) {
	int32_t index = 0;
	uint8_t *send_buffer_global = mempools_get_packet_buffer();
	send_buffer_global[index++] = COMM_CUSTOM_APP_DATA;
	memcpy(send_buffer_global + index, data, len);
	index += len;
	commands_send_packet(send_buffer_global, index);
	mempools_free_packet_buffer(send_buffer_global);
}

void commands_send_hw_data(unsigned char *data, unsigned int len) {
	int32_t index = 0;
	uint8_t *send_buffer_global = mempools_get_packet_buffer();
	send_buffer_global[index++] = COMM_CUSTOM_HW_DATA;
	memcpy(send_buffer_global + index, data, len);
	index += len;
	commands_send_packet(send_buffer_global, index);
	mempools_free_packet_buffer(send_buffer_global);
}

void commands_send_gpd_buffer_notify(void) {
	int32_t index = 0;
	uint8_t buffer[1];
	buffer[index++] = COMM_GPD_BUFFER_NOTIFY;
	commands_send_packet(buffer, index);
}

void commands_send_mcconf(COMM_PACKET_ID packet_id, mc_configuration* mcconf, void(*reply_func)(unsigned char* data, unsigned int len)) {
	uint8_t *send_buffer_global = mempools_get_packet_buffer();
	send_buffer_global[0] = packet_id;
	int32_t len = confgenerator_serialize_mcconf(send_buffer_global + 1, mcconf);
	if (reply_func) {
		reply_func(send_buffer_global, len + 1);
	} else {
		commands_send_packet(send_buffer_global, len + 1);
	}
	mempools_free_packet_buffer(send_buffer_global);
}

void commands_send_appconf(COMM_PACKET_ID packet_id, app_configuration *appconf, void(*reply_func)(unsigned char* data, unsigned int len)) {
	uint8_t *send_buffer_global = mempools_get_packet_buffer();
	send_buffer_global[0] = packet_id;
	int32_t len = confgenerator_serialize_appconf(send_buffer_global + 1, appconf);
	if (reply_func) {
		reply_func(send_buffer_global, len + 1);
	} else {
		commands_send_packet(send_buffer_global, len + 1);
	}
	mempools_free_packet_buffer(send_buffer_global);
}

inline static float hw_lim_upper(float l, float h) {(void)l; return h;}

void commands_apply_mcconf_hw_limits(mc_configuration *mcconf) {
	utils_truncate_number(&mcconf->l_current_max_scale, 0.0, 1.0);
	utils_truncate_number(&mcconf->l_current_min_scale, 0.0, 1.0);
	utils_truncate_number(&mcconf->l_erpm_start, 0.0, 1.0);
	utils_truncate_number(&mcconf->foc_overmod_factor, 1.0, 1.5);

	float ctrl_loop_freq = 0.0;

#if FOC_CONTROL_LOOP_FREQ_DIVIDER < 2 // When skipping cycles you are on your own!
	// This limit should always be active, as starving the threads never
	// makes sense.
#ifdef HW_LIM_FOC_CTRL_LOOP_FREQ
    if (mcconf->foc_control_sample_mode == FOC_CONTROL_SAMPLE_MODE_V0_V7) {
    	//control loop executes twice per pwm cycle when sampling in v0 and v7
		utils_truncate_number(&mcconf->foc_f_zv, HW_LIM_FOC_CTRL_LOOP_FREQ);
		ctrl_loop_freq = mcconf->foc_f_zv;
    } else {
#ifdef HW_HAS_DUAL_MOTORS
    	utils_truncate_number(&mcconf->foc_f_zv, HW_LIM_FOC_CTRL_LOOP_FREQ);
    	ctrl_loop_freq = mcconf->foc_f_zv;
#else
		utils_truncate_number(&mcconf->foc_f_zv, HW_LIM_FOC_CTRL_LOOP_FREQ * 2.0);
		ctrl_loop_freq = mcconf->foc_f_zv / 2.0;
#endif
    }
#endif
#endif

    if (ctrl_loop_freq >= (hw_lim_upper(HW_LIM_FOC_CTRL_LOOP_FREQ) * 0.9)) {
    	utils_truncate_number_int(&mcconf->m_hall_extra_samples, 0, 2);
    } else if (ctrl_loop_freq >= (hw_lim_upper(HW_LIM_FOC_CTRL_LOOP_FREQ) * 0.7)) {
    	utils_truncate_number_int(&mcconf->m_hall_extra_samples, 0, 4);
    } else {
    	utils_truncate_number_int(&mcconf->m_hall_extra_samples, 0, 10);
    }

    utils_truncate_number_abs(&mcconf->foc_sl_erpm_start, mcconf->foc_sl_erpm * 0.9);

#ifndef DISABLE_HW_LIMITS

    // TODO: Maybe truncate values that get close to numerical instabilities when set
    // close to each other, such as
    //
    // conf->l_temp_motor_start, conf->l_temp_motor_end
    // and
    // conf->l_temp_fet_start, conf->l_temp_fet_end
    //
    // A division by 0 is avoided in the code, but getting close can still make things
    // oscillate. At the moment we leave the responsibility of setting sane values
    // to the user.

#ifdef HW_LIM_CURRENT
	utils_truncate_number(&mcconf->l_current_max, HW_LIM_CURRENT);
	utils_truncate_number(&mcconf->l_current_min, HW_LIM_CURRENT);
	utils_truncate_number(&mcconf->foc_hfi_amb_current, HW_LIM_CURRENT);
#endif
#ifdef HW_LIM_CURRENT_IN
	utils_truncate_number(&mcconf->l_in_current_max, HW_LIM_CURRENT_IN);
	utils_truncate_number(&mcconf->l_in_current_min, HW_LIM_CURRENT);
#endif
#ifdef HW_LIM_CURRENT_ABS
	utils_truncate_number(&mcconf->l_abs_current_max, HW_LIM_CURRENT_ABS);
#endif
#ifdef HW_LIM_VIN
	utils_truncate_number(&mcconf->l_max_vin, HW_LIM_VIN);
	utils_truncate_number(&mcconf->l_min_vin, HW_LIM_VIN);
#endif
#ifdef HW_LIM_ERPM
	utils_truncate_number(&mcconf->l_max_erpm, HW_LIM_ERPM);
	utils_truncate_number(&mcconf->l_min_erpm, HW_LIM_ERPM);
#endif
#ifdef HW_LIM_DUTY_MIN
	utils_truncate_number(&mcconf->l_min_duty, HW_LIM_DUTY_MIN);
#endif
#ifdef HW_LIM_DUTY_MAX
	utils_truncate_number(&mcconf->l_max_duty, HW_LIM_DUTY_MAX);
#endif
#ifdef HW_LIM_TEMP_FET
	utils_truncate_number(&mcconf->l_temp_fet_start, HW_LIM_TEMP_FET);
	utils_truncate_number(&mcconf->l_temp_fet_end, HW_LIM_TEMP_FET);
#endif
#ifdef HW_FOC_CURRENT_FILTER_LIM
	utils_truncate_number(&mcconf->foc_current_filter_const, HW_FOC_CURRENT_FILTER_LIM);
#endif
#endif
}

void commands_init_plot(const char *namex, const char *namey) {
	int ind = 0;
	uint8_t *send_buffer_global = mempools_get_packet_buffer();
	send_buffer_global[ind++] = COMM_PLOT_INIT;
	memcpy(send_buffer_global + ind, namex, strlen(namex));
	ind += strlen(namex);
	send_buffer_global[ind++] = '\0';
	memcpy(send_buffer_global + ind, namey, strlen(namey));
	ind += strlen(namey);
	send_buffer_global[ind++] = '\0';
	commands_send_packet(send_buffer_global, ind);
	mempools_free_packet_buffer(send_buffer_global);
}

