Avnzx/bldc-STM32f446/comm/commands.c
				uint8_t hall_tab[8];
				bool res;
				mcpwm_foc_hall_detect(current, hall_tab, &res);
				mc_interface_set_configuration(mcconf_old);

				ind = 0;
				send_buffer[ind++] = COMM_DETECT_HALL_FOC;
				memcpy(send_buffer + ind, hall_tab, 8);
				ind += 8;
				send_buffer[ind++] = res ? 0 : 1;

				if (send_func_blocking) {
					send_func_blocking(send_buffer, ind);
				}

				mempools_free_mcconf(mcconf_old);
			} else {
				int32_t ind = 0;
				send_buffer[ind++] = COMM_DETECT_HALL_FOC;
				memset(send_buffer, 255, 8);
				ind += 8;
				send_buffer[ind++] = 0;
				if (send_func_blocking) {
					send_func_blocking(send_buffer, ind);
				}
			}

			mempools_free_mcconf(mcconf);
		} break;

		case COMM_DETECT_MOTOR_FLUX_LINKAGE_OPENLOOP: {
			int32_t ind = 0;
			float current = buffer_get_float32(data, 1e3, &ind);
			float erpm_per_sec = buffer_get_float32(data, 1e3, &ind);
			float duty = buffer_get_float32(data, 1e3, &ind);
			float resistance = buffer_get_float32(data, 1e6, &ind);
			float inductance = 0.0;

			if (len >= (uint32_t)ind + 4) {
				inductance = buffer_get_float32(data, 1e8, &ind);
			}

			float linkage, linkage_undriven, undriven_samples;
			bool res;
			float enc_offset, enc_ratio;
			bool enc_inverted;
			int fault = conf_general_measure_flux_linkage_openloop(current, duty,
																   erpm_per_sec, resistance, inductance,
																   &linkage, &linkage_undriven, &undriven_samples, &res,
																   &enc_offset, &enc_ratio, &enc_inverted);

			if (fault != FAULT_CODE_NONE) {
				linkage = 0.0;
			} else {
				if (undriven_samples > 60) {
					linkage = linkage_undriven;
				}

				if (!res) {
					linkage = 0.0;
				}
			}


			ind = 0;
			send_buffer[ind++] = COMM_DETECT_MOTOR_FLUX_LINKAGE_OPENLOOP;
			buffer_append_float32(send_buffer, linkage, 1e7, &ind);
			buffer_append_float32(send_buffer, enc_offset, 1e6, &ind);
			buffer_append_float32(send_buffer, enc_ratio, 1e6, &ind);
			send_buffer[ind++] = enc_inverted;
			if (send_func_blocking) {
				send_func_blocking(send_buffer, ind);
			}
		} break;

		case COMM_DETECT_APPLY_ALL_FOC: {
			int32_t ind = 0;
			bool detect_can = data[ind++];
			float max_power_loss = buffer_get_float32(data, 1e3, &ind);
			float min_current_in = buffer_get_float32(data, 1e3, &ind);
			float max_current_in = buffer_get_float32(data, 1e3, &ind);
			float openloop_rpm = buffer_get_float32(data, 1e3, &ind);
			float sl_erpm = buffer_get_float32(data, 1e3, &ind);

			int res = conf_general_detect_apply_all_foc_can(detect_can, max_power_loss,
					min_current_in, max_current_in, openloop_rpm, sl_erpm, send_func_blocking);

			ind = 0;
			send_buffer[ind++] = COMM_DETECT_APPLY_ALL_FOC;
			buffer_append_int16(send_buffer, res, &ind);
			if (send_func_blocking) {
				send_func_blocking(send_buffer, ind);
			}
		} break;

		case COMM_TERMINAL_CMD:
			data[len] = '\0';
			chMtxLock(&terminal_mutex);
			terminal_process_string((char*)data);
			chMtxUnlock(&terminal_mutex);
			break;

		case COMM_PING_CAN: {
			int32_t ind = 0;
			send_buffer[ind++] = COMM_PING_CAN;

			for (uint8_t i = 0;i < 255;i++) {
				HW_TYPE hw_type;
				if (comm_can_ping(i, &hw_type)) {
					send_buffer[ind++] = i;
				}
			}

			if (send_func_blocking) {
				send_func_blocking(send_buffer, ind);
			}
		} break;

		case COMM_GET_IMU_CALIBRATION: {
			int32_t ind = 0;
			send_buffer[ind++] = COMM_GET_IMU_CALIBRATION;
			if (send_func_blocking) {
				send_func_blocking(send_buffer, ind);
			}
		} break;

		case COMM_CAN_UPDATE_BAUD_ALL: {
			int32_t ind = 0;
			uint32_t kbits = buffer_get_int16(data, &ind);
			uint32_t delay_msec = buffer_get_int16(data, &ind);

			CAN_BAUD baud = comm_can_kbits_to_baud(kbits);
			if (baud != CAN_BAUD_INVALID) {
				for (int i = 0;i < 10;i++) {
					comm_can_send_update_baud(kbits, delay_msec);
					chThdSleepMilliseconds(50);
				}

				comm_can_set_baud(baud, delay_msec);

				app_configuration *appconf = (app_configuration*)app_get_configuration();
				appconf->can_baud_rate = baud;
				conf_general_store_app_configuration(appconf);
			}

			ind = 0;
			send_buffer[ind++] = packet_id;
			send_buffer[ind++] = baud != CAN_BAUD_INVALID;
			if (send_func_blocking) {
				send_func_blocking(send_buffer, ind);
			}
		} break;

		default:
			break;
		}
	}
}
